[
	{"Code_100": "This interim response is used to inform the client that the initial part of the request has been received and has not yet been rejected by the server. The client SHOULD continue by sending the remainder of the request or, if the request has already been completed, ignore this response"},
	{"Code_101": "The server understands and is willing to comply with the client's request, via the Upgrade message header field, for a change in the application protocol being used on this connection. The server will switch protocols to those defined by the response's Upgrade header field immediately after the empty line which terminates the 101 response." },
	{"Code_200": "The request has succeeded."},
	{"Code_201": "The request has been fulfilled and resulted in a new resource being created. The newly created resource can be referenced by the URI(s) returned in the entity of the response, with the most specific URI for the resource given by a Location header field."},
	{"Code_202": "The request has been accepted for processing, but the processing has not been completed."},
	{"Code_203": "The returned metainformation in the entity-header is not the definitive set as available from the origin server, but is gathered from a local or a third-party copy."},
	{"Code_204": "The server has fulfilled the request but does not need to return an entity-body"},
	{"Code_205": "The server has fulfilled the request and the user agent SHOULD reset the document view which caused the request to be sent."},
	{"Code_206": "The server has fulfilled the partial GET request for the resource. See Range header field for more information"},
	{"Code_300": "The requested resource corresponds to any one of a set of representations. User can select prefered representation and redirect its request to that location"},
	{"Code_301": "The requested resource has been assigned a new permanent URI and any future references to this resource SHOULD use one of the returned URIs."},
	{"Code_302": "The requested resource resides temporarily under a different URI."},
	{"Code_303": "The response to the request can be found under a different URI and SHOULD be retrieved using a GET method on that resource."},
	{"Code_304": "Conditional GET request accepted, access is allowed, document WAS NOT modiefied"},
	{"Code_305": "The requested resource MUST be accessed through the proxy given by the Location field."},
	{"Code_307": "The requested resource resides temporarily under a different URI. Since the redirection MAY be altered on occasion, the client SHOULD continue to use the Request-URI for future requests."},
	{"Code_400": "The request could not be understood by the server due to malformed syntax."},
	{"Code_401": "The request requires user authentication."},
	{"Code_403": " The server understood the request, but is refusing to fulfill it. Authorization will not help and the request SHOULD NOT be repeated."},
	{"Code_404": "The server has not found anything matching the Request-URI."},
	{"Code_405": "The method specified in the Request-Line is not allowed for the resource identified by the Request-URI."},
	{"Code_406": "The resource identified by the request is only capable of generating response entities which have content characteristics not acceptable according to the accept headers sent in the request."},
	{"Code_407": "Client must first authenticate itself with the proxy"},
	{"Code_408": "The client did not produce a request within the time that the server was prepared to wait. The client MAY repeat the request without modifications at any later time."},
	{"Code_409": "The request could not be completed due to a conflict with the current state of the resource."},
	{"Code_410": "The requested resource is no longer available at the server and no forwarding address is known."},
	{"Code_411": "The server refuses to accept the request without a defined Content-Length."},
	{"Code_412": "The precondition given in one or more of the request-header fields evaluated to false when it was tested on the server."},
	{"Code_413": "The server is refusing to process a request because the request entity is larger than the server is willing or able to process."},
	{"Code_414": "The server is refusing to service the request because the Request-URI is longer than the server is willing to interpret."},
	{"Code_415": "The server is refusing to service the request because the entity of the request is in a format not supported by the requested resource for the requested method."},
	{"Code_417": "The expectation given in an Expect request-header field could not be met by this server."},
	{"Code_500": "The server encountered an unexpected condition which prevented it from fulfilling the request."},
	{"Code_501": "The server does not support the functionality required to fulfill the request. "},
	{"Code_502": "The server, while acting as a gateway or proxy, received an invalid response from the upstream server it accessed in attempting to fulfill the request."},
	{"Code_503": "The server is currently unable to handle the request due to a temporary overloading or maintenance of the server."},
	{"Code_504": "The server, while acting as a gateway or proxy, did not receive a timely response from the upstream server specified by the URI (e.g. HTTP, FTP, LDAP) or some other auxiliary server (e.g. DNS) it needed to access in attempting to complete the request."},
	{"Code_505": "The server does not support, or refuses to support, the HTTP protocol version that was used in the request message."}
]